# GetNormals Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Mesh..::..GetNormals Method
Mesh Class See Also
---
Returns all normals assigned to the mesh.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public IList<XYZ> GetNormals()
```

Visual Basic
---
```text
Public Function GetNormals As IList(Of XYZ)
```

Visual C++
---
```text
public:
IList<XYZ^>^ GetNormals()
```

# ### Return Value
An array of XYZ values, each representing a normal unit vector.
# See Also
Mesh Class
Autodesk.Revit.DB Namespace